app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Test"], ["post_id", 1], ["created_at", "2020-06-21 02:15:13.450440"], ["updated_at", "2020-06-21 02:15:13.450440"]]
---
  def create
    post = Post.find(params[:post_id])
    comment = post.comments.create(comment_params)