app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["content", "test"], ["created_at", "2020-06-21 03:08:11.793619"], ["updated_at", "2020-06-21 03:08:11.793619"]]
---
  def create
    post = Post.create(post_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @post = Post.includes(:comments).find(params[:id])